{
  "name": "std::io::read_to_string",
  "span": "$library/std/src/io/mod.rs:1321:1: 1321:64",
  "doc": " Reads all bytes from a [reader][Read] into a new [`String`].\n\n This is a convenience function for [`Read::read_to_string`]. Using this\n function avoids having to create a variable first and provides more type\n safety since you can only get the buffer out if there were no errors. (If you\n use [`Read::read_to_string`] you have to remember to check whether the read\n succeeded because otherwise your buffer will be empty or only partially full.)\n\n # Performance\n\n The downside of this function's increased ease of use and type safety is\n that it gives you less control over performance. For example, you can't\n pre-allocate memory like you can using [`String::with_capacity`] and\n [`Read::read_to_string`]. Also, you can't re-use the buffer if an error\n occurs while reading.\n\n In many cases, this function's performance will be adequate and the ease of use\n and type safety tradeoffs will be worth it. However, there are cases where you\n need more control over performance, and in those cases you should definitely use\n [`Read::read_to_string`] directly.\n\n Note that in some special cases, such as when reading files, this function will\n pre-allocate memory based on the size of the input it is reading. In those\n cases, the performance should be as good as if you had used\n [`Read::read_to_string`] with a manually pre-allocated buffer.\n\n # Errors\n\n This function forces you to handle errors because the output (the `String`)\n is wrapped in a [`Result`]. See [`Read::read_to_string`] for the errors\n that can occur. If any error occurs, you will get an [`Err`], so you\n don't have to worry about your buffer being empty or partially full.\n\n # Examples\n\n ```no_run\n # use std::io;\n fn main() -> io::Result<()> {\n     let stdin = io::read_to_string(io::stdin())?;\n     println!(\"Stdin was:\");\n     println!(\"{stdin}\");\n     Ok(())\n }\n ```\n\n # Usage Notes\n\n `read_to_string` attempts to read a source until EOF, but many sources are continuous streams\n that do not send EOF. In these cases, `read_to_string` will block indefinitely. Standard input\n is one such stream which may be finite if piped, but is typically continuous. For example,\n `cat file | my-rust-program` will correctly terminate with an `EOF` upon closure of cat.\n Reading user input or running programs that remain open indefinitely will never terminate\n the stream with `EOF` (e.g. `yes | my-rust-program`).\n\n Using `.lines()` with a [`BufReader`] or using [`read`] can provide a better solution\n\n[`read`]: Read::read\n\n"
}