{
  "name": "x86_64::PrivilegeLevel",
  "constructors": [],
  "access_self_as_arg": {
    "read": [],
    "write": [],
    "other": []
  },
  "access_self_as_locals": {
    "read": [],
    "write": [],
    "other": [
      "ostd::arch::trap::gdt::init_on_cpu"
    ]
  },
  "access_field": [],
  "span": "/home/gh-zjp-CN/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/x86_64-0.14.13/src/lib.rs:23:1: 23:24",
  "src": "pub enum PrivilegeLevel",
  "kind": "Enum",
  "doc_adt": " Represents a protection ring level.\n",
  "variant_fields": {
    "VariantIdx(Some(0))-FieldIdx(None)": {
      "name": "Ring0",
      "doc": " Privilege-level 0 (most privilege): This level is used by critical system-software\n components that require direct access to, and control over, all processor and system\n resources. This can include BIOS, memory-management functions, and interrupt handlers.\n"
    },
    "VariantIdx(Some(1))-FieldIdx(None)": {
      "name": "Ring1",
      "doc": " Privilege-level 1 (moderate privilege): This level is used by less-critical system-\n software services that can access and control a limited scope of processor and system\n resources. Software running at these privilege levels might include some device drivers\n and library routines. The actual privileges of this level are defined by the\n operating system.\n"
    },
    "VariantIdx(Some(2))-FieldIdx(None)": {
      "name": "Ring2",
      "doc": " Privilege-level 2 (moderate privilege): Like level 1, this level is used by\n less-critical system-software services that can access and control a limited scope of\n processor and system resources. The actual privileges of this level are defined by the\n operating system.\n"
    },
    "VariantIdx(Some(3))-FieldIdx(None)": {
      "name": "Ring3",
      "doc": " Privilege-level 3 (least privilege): This level is used by application software.\n Software running at privilege-level 3 is normally prevented from directly accessing\n most processor and system resources. Instead, applications request access to the\n protected processor and system resources by calling more-privileged service routines\n to perform the accesses.\n"
    }
  }
}