{
  "name": "ptr::with_exposed_provenance_mut",
  "safe": true,
  "callees": {},
  "adts": {},
  "path": 16094,
  "span": "/home/gh-zjp-CN/.rustup/toolchains/nightly-2025-12-06-aarch64-unknown-linux-gnu/lib/rustlib/src/rust/library/core/src/ptr/mod.rs:1026:1: 1028:2",
  "src": "pub const fn with_exposed_provenance_mut<T>(addr: usize) -> *mut T {\n    addr as *mut T\n}",
  "mir": "fn ptr::with_exposed_provenance_mut(_1: usize) -> *mut T {\n    let mut _0: *mut T;\n    debug addr => _1;\n    bb0: {\n        _0 = _1 as *mut T;\n        return;\n    }\n}\n",
  "doc": " Converts an address back to a mutable pointer, picking up some previously 'exposed'\n [provenance][crate::ptr#provenance].\n\n This is fully equivalent to `addr as *mut T`. The provenance of the returned pointer is that\n of *some* pointer that was previously exposed by passing it to\n [`expose_provenance`][pointer::expose_provenance], or a `ptr as usize` cast. In addition, memory\n which is outside the control of the Rust abstract machine (MMIO registers, for example) is\n always considered to be accessible with an exposed provenance, so long as this memory is disjoint\n from memory that will be used by the abstract machine such as the stack, heap, and statics.\n\n The exact provenance that gets picked is not specified. The compiler will do its best to pick\n the \"right\" provenance for you (whatever that may be), but currently we cannot provide any\n guarantees about which provenance the resulting pointer will have -- and therefore there\n is no definite specification for which memory the resulting pointer may access.\n\n If there is *no* previously 'exposed' provenance that justifies the way the returned pointer\n will be used, the program has undefined behavior. In particular, the aliasing rules still apply:\n pointers and references that have been invalidated due to aliasing accesses cannot be used\n anymore, even if they have been exposed!\n\n Due to its inherent ambiguity, this operation may not be supported by tools that help you to\n stay conformant with the Rust memory model. It is recommended to use [Strict\n Provenance][self#strict-provenance] APIs such as [`with_addr`][pointer::with_addr] wherever\n possible.\n\n On most platforms this will produce a value with the same bytes as the address. Platforms\n which need to store additional information in a pointer may not support this operation,\n since it is generally not possible to actually *compute* which provenance the returned\n pointer has to pick up.\n\n This is an [Exposed Provenance][crate::ptr#exposed-provenance] API.\n",
  "tags": {
    "tags": [
      {
        "tag": {
          "typ": null,
          "name": "fuzzy_provenance_casts"
        },
        "args": []
      }
    ],
    "spec": {},
    "docs": [
      "* fuzzy_provenance_casts\n"
    ]
  }
}